# ----------------------------------------
#  Brewfile
# ----------------------------------------
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/services"
cask_args appdir: "/Applications"
brew "mas"
# ========== General Tools ==========
brew "git"
brew "gh"
brew "ghq"
brew "peco"
brew "tree"
brew "htop"
brew "wget"
brew "jq"
brew "curl"
brew "direnv"
brew "git-secrets"
brew "rbenv"
brew "pyenv"
brew "ffmpeg"

# ========== App Tools ==========
# terraform
brew "tfenv"
brew "tflint"

# load test
brew "vegeta"

# node
brew "nodebrew"

# k8s
brew "kubectl"
brew "helm"
brew "kustomize"

# ========== Languages ==========
brew "go"

# ========== gRPC ==========
brew "protobuf"

# ========== Applications ==========
cask "clipy"
cask "rectangle"
cask "slack"
cask "docker"
cask "kindle"
cask "iterm2"
cask "figma"
cask "zoom"
cask "visual-studio-code"
cask "google-japanese-ime"
cask "deepl"
cask "obs"
cask "discord"
cask "google-cloud-sdk"
