# ----------------------------------------
#  Brewfile
# ----------------------------------------
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/services"
cask_args appdir: "/Applications"
brew "mas"
# ========== General Tools ==========
brew "git"
brew "gh"
brew "ghq"
brew "peco"
brew "tree"
brew "exa"
brew "wget"
brew "jq"
brew "curl"

# ========== App Tools ==========
# terraform
brew "tfenv"
brew "tflint"

# load test
brew "jmeter"
brew "vegeta"

# node
brew "nodebrew"

# k8s
brew "kubectl"
brew "helm"
brew "kustomize"

# ========== Languages ==========
brew "go"

# ========== Applications ==========
cask "clipy"
cask "shiftit"
cask "slack"
cask "docker"
cask "kindle"
cask "iterm2"
cask "figma"
cask "zoom"
cask "postman"
cask "cyberduck"
cask "gpg-suite"
cask "chromedriver"
cask "google-chrome"
cask "visual-studio-code"
cask "google-japanese-ime"
cask "deepl"
cask "obs"
cask "tableplus"
cask "notion"
